Tekla Open API Reference for Tekla Structures 2025
StructuresDialogFilterAttribute Constructor
 Initializes a new StructuresDialogFilterAttribute instance.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StructuresDialogFilterAttribute(
	string attributeName
)
Public Sub New (
	attributeName As String
)
Parameters
attributeName
Type: System.String
The attribute name of the attributed property.
See Also
Reference
StructuresDialogFilterAttribute Class
Tekla.Structures.Dialog Namespace